saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM4_DFP.1.2.0.pdsc
      <!-- ************************  Subfamily 'M440'  **************************** -->
      <subFamily DsubFamily="M440">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Configurable"/>
        <!-- book name="Documents\??.pdf" title="M440 User Manual"/-->

        <feature type="ExtBus"        n="16"                          name="External Bus Interface for SRAM Communication"/>
        <feature type="DMA"           n="6"/>
        <feature type="UART"          n="6"                           name="UART/SIO"/>
        <feature type="UART"          n="2"                           name="Full UART"/>
        <feature type="I2C"           n="1"/>
        <feature type="ComOther"      n="3"                           name="Enhanced Serial I/O"/>
        <feature type="ADC"           n="20"      m="12"/>
        <feature type="DAC"           n="2"       m="10"/>
        <feature type="Timer"         n="20"      m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="Timer"         n="1"       m="16"              name="Hi-resolution 16Bit Timer"/>
        <feature type="Timer"         n="1"                           name="2-phase pulse counter(PHC)"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"       m="32768"/>
        <feature type="Other"         n="1"                           name="Servo/Sequence Controller"/>
        <feature type="ExtInt"        n="24"/>
        <feature type="IOs"           n="228"/>
        <feature type="VCC"           n="2.70"    m="3.60"/>
        <feature type="Temp"          n="-40"     m="85"/>
        <feature type="BGA"           n="289"/>


        <!-- *************************  Device 'TMPM440FEXBG'  ***************************** -->
        <device Dname="TMPM440FEXBG">
          <processor Dclock="100000000"/>
          <compile header="Device\Include\TMPM440.h"  define="TMPM440FEXBG"/>
<!--  ignore because of errors
          <debug      svd="SVD\M440.svd"/>
-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\TMPM440_768.FLM"    start="0x00000000"  size="0xC0000"                  default="1"/>
        </device>

        <!-- *************************  Device 'TMPM440F10XBG'  ***************************** -->
        <device Dname="TMPM440F10XBG">
          <processor Dclock="100000000"/>
          <compile header="Device\Include\TMPM440.h"  define="TMPM440F10XBG"/>
<!--  ignore because of errors
          <debug      svd="SVD\M440.svd"/>
-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\TMPM440_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M460'  **************************** -->
      <subFamily DsubFamily="M460">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
        <!-- book name="Documents\??.pdf" title="M460 User Manual"/-->

        <feature type="DMA"           n="32"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="RTC"           n="1"       m="32768"/>
        <feature type="VCC"           n="2.70"    m="3.60"/>
        <feature type="Temp"          n="-40"     m="85"/>


        <!-- *************************  Device 'TMPM461F10FG'  ***************************** -->
        <device Dname="TMPM461F10FG">
          <processor Dclock="120000000"/>
          <book  name="Documents\TMPM461F10FG_datasheet_en_20141110.pdf"  title="TMPM461F15/F10FG Data Sheet"/>
          <compile header="Device\Include\TMPM461.h"  define="TMPM461F10FG"/>
          <debug      svd="SVD\M461.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20030000"  size="0x00400"    init   ="0"   default="0"/>
          <algorithm  name="Flash\TMPM461_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>

          <feature type="ExtBus"        n="16"                          name="External Bus Interface for SRAM Communication"/>
          <feature type="UART"          n="2"                           name="Full UART"/>
          <feature type="I2C"           n="5"/>
          <feature type="ComOther"      n="3"                           name="Synchronous Serial interface"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="Timer"         n="16"      m="16"/>
          <feature type="Timer"         n="2"       m="16"              name="Multi Purpose Timer"/>
          <feature type="Other"         n="1"                           name="Remote Control Signal Preprocessor"/>
          <feature type="UART"          n="6"                           name="UART/SIO"/>
          <feature type="IOs"           n="111"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'TMPM461F15FG'  ***************************** -->
        <device Dname="TMPM461F15FG">
          <processor Dclock="120000000"/>
          <book  name="Documents\TMPM461F10FG_datasheet_en_20141110.pdf"  title="TMPM461F15/F10FG Data Sheet"/>
          <compile header="Device\Include\TMPM461.h"  define="TMPM461F15FG"/>
          <debug svd="SVD\M461.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x180000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20030000"  size="0x00400"    init   ="0"   default="0"/>
          <algorithm  name="Flash\TMPM461_1536.FLM"   start="0x00000000"  size="0x180000"                 default="1"/>

