saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TMPM4_DFP.1.2.0.pdsc
    <condition id="TMPM46B CMSIS">
      <description>Toshiba TMPM46B Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM46B*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM470 CMSIS">
      <description>Toshiba TMPM470 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM470*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="TMPM475 CMSIS">
      <description>Toshiba TMPM475 Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM475*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup TMPM411 unitA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM411_unitA CMSIS">
      <description>System Startup for Toshiba TMPM411 unitA Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM411_unitA.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM411_unitA.c"         attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup TMPM411 unitB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM411_unitB CMSIS">
      <description>System Startup for Toshiba TMPM411 unitB Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM411_unitB.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM411_unitB.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM440 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM440 CMSIS">
      <description>System Startup for Toshiba TMPM440 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM440.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM440.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM461 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM461 CMSIS">
      <description>System Startup for Toshiba TMPM461 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM461.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM461.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM462 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM462 CMSIS">
      <description>System Startup for Toshiba TMPM462 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM462.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM462.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM46B -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM46B CMSIS">
      <description>System Startup for Toshiba TMPM46B Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM46B.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM46B.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM470 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM470 CMSIS">
      <description>System Startup for Toshiba TMPM470 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM470.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM470.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM475 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM475 CMSIS">
      <description>System Startup for Toshiba TMPM475 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM475.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM475.c"         attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

</package>
